﻿﻿﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************

//<AMI_FHDR_START>
//-----------------------------------------------------------------------
//
// Name:		Nb.uni
//
// Description:	This contains the unicode strings pertaining to NB
//
//-----------------------------------------------------------------------
//<AMI_FHDR_END>

//P20130624 >>
/=#
#include "VFR.uni"
#string STR_NB_FORM                     #language eng "North Bridge"
#string STR_NB_FORM_HELP                #language eng "North Bridge Parameters"
#string STR_MEMORY                      #language eng "Memory Information"
#string STR_MEMORY_CONFIGURATION        #language eng "Memory Confighration"
#string STR_MEMORY_SIZE_NAME            #language eng "Total Memory"
#string STR_MEMORY_SIZE_VALUE           #language eng "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP            #language eng "Total Memory in the System."
#string STR_MEMORY_SIZE_SLOT_HELP       #language eng "Memory in the slot."
#string STR_MEMORY_SIZE_SLOT0_NAME      #language eng "Memory Slot0"
#string STR_MEMORY_SIZE_SLOT1_NAME      #language eng "Memory Slot1"
#string STR_MEMORY_SIZE_SLOT2_NAME      #language eng "Memory Slot2"
#string STR_MEMORY_SIZE_SLOT3_NAME      #language eng "Memory Slot3"
#string STR_MEMORY_SIZE_SLOT0_VALUE     #language eng "Not Present"
#string STR_MEMORY_SIZE_SLOT1_VALUE     #language eng "Not Present"
#string STR_MEMORY_SIZE_SLOT2_VALUE     #language eng "Not Present"
#string STR_MEMORY_SIZE_SLOT3_VALUE     #language eng "Not Present"
//P20130624 <<
//---------------------------------------------------------------------------
// IGD Configuration
//---------------------------------------------------------------------------

#string STR_INTEL_IGD_FORM              #language eng "Intel IGD Configuration"
#string STR_INTEL_IGD_HELP              #language eng "Config Intel IGD Settings."

// GOP Configuration
#string STR_GOD_CONFIGURATION_TITLE     #language eng "GOP Configuration"
#string STR_GOD_DRIVER_PROMPT           #language eng "GOP Driver"
#string STR_GOD_DRIVER_HELP             #language eng "Enable GOP Driver will unload VBIOS; Disbale it will load VBIOS"

//==============

// Integrated Graphics Device
#string STR_INT_GRAPHICS_PROMPT         #language eng "Integrated Graphics Device"
#string STR_INT_GRAPHICS_HELP           #language eng "Enable : Enable Integrated Graphics Device (IGD) when selected as the Primary Video Adaptor. Disable: Always disbale IGD"

#string STR_IGD_TURBO_ENABLE_PROMPT         #language eng "IGD Turbo Enable"
#string STR_IGD_TURBO_ENABLE_HELP           #language eng "Enable : Enable IGD Turbo Enable. Disable: IGD Turbo Disable"

// Primary Display
#string STR_PRIMARY_DISPLAY_PROMPT      #language eng "Primary Display"
#string STR_PRIMARY_DISPLAY_HELP        #language eng "Select which of IGD/PCI Graphics device should be Primary Display."
#string STR_PRIMARY_DISPLAY_IGD         #language eng "IGD"
#string STR_PRIMARY_DISPLAY_PCIE        #language eng "PCIe"
#string STR_PRIMARY_DISPLAY_AUTO        #language eng "Auto"
#string STR_PRIMARY_DISPLAY_SG          #language eng "SG"

// GFX Boost
#string STR_GFX_BOOTS_PROMPT            #language eng "GFX Boost"
#string STR_GFX_BOOTS_HELP              #language eng "Enable/Disable GFX Boost"

// PAVC 
#string STR_PAVC_PROMPT                 #language eng "PAVC"
#string STR_PAVC_HELP                   #language eng "Enable/Disable Protected Audio Video Control"
#string STR_PAVC_LITE                   #language eng "LITE Mode"
#string STR_PAVC_SERPENT                #language eng "SERPENT Mode"

//P20130628 >>
// DOP CG
#string STR_DOP_CG_PROMPT             #language eng "DOP CG"
#string STR_DOP_CG_HELP               #language eng "Enable/Disable DOP Clock Gating"
//P20130628 <<

// GTT Size
#string STR_GTT_SIZE_PROMPT             #language eng "GTT Size"
#string STR_GTT_SIZE_HELP               #language eng "Select the GTT Size "
#string STR_GTT_SIZE_1MB                #language eng "1MB"
#string STR_GTT_SIZE_2MB                #language eng "2MB"

// Aperture Size
#string STR_APERTURE_SIZE_PROMPT        #language eng "Aperture Size"
#string STR_APERTURE_SIZE_HELP          #language eng "Select the Aperture Size"
#string STR_APERTURE_SIZE_128MB         #language eng "128MB"
#string STR_APERTURE_SIZE_256MB         #language eng "256MB"
#string STR_APERTURE_SIZE_512MB         #language eng "512MB"

// DVMT Pre-Allocated
#string STR_DVMT_PRE_ALLOC_PROMPT     #language eng "DVMT Pre-Allocated"
#string STR_DVMT_PRE_ALLOC_HELP       #language eng "Select DVMT 5.0 Pre-Allocated (Fixed) Graphics Memory size used by the Internal Graphics Device."
#string STR_DVMT_PRE_ALLOC_0M         #language eng "0M"
#string STR_DVMT_PRE_ALLOC_32M        #language eng "32M"
#string STR_DVMT_PRE_ALLOC_64M        #language eng "64M"
#string STR_DVMT_PRE_ALLOC_96M        #language eng "96M"
#string STR_DVMT_PRE_ALLOC_128M       #language eng "128M"
#string STR_DVMT_PRE_ALLOC_160M       #language eng "160M"
#string STR_DVMT_PRE_ALLOC_192M       #language eng "192M"
#string STR_DVMT_PRE_ALLOC_224M       #language eng "224M"
#string STR_DVMT_PRE_ALLOC_256M       #language eng "256M"
#string STR_DVMT_PRE_ALLOC_288M       #language eng "288M"
#string STR_DVMT_PRE_ALLOC_320M       #language eng "320M"
#string STR_DVMT_PRE_ALLOC_352M       #language eng "352M"
#string STR_DVMT_PRE_ALLOC_384M       #language eng "384M"
#string STR_DVMT_PRE_ALLOC_416M       #language eng "416M"
#string STR_DVMT_PRE_ALLOC_448M       #language eng "448M"
#string STR_DVMT_PRE_ALLOC_480M       #language eng "480M"
#string STR_DVMT_PRE_ALLOC_512M       #language eng "512M"

// DVMT Total Gfx Mem
#string STR_DVMT_TOTAL_GFX_MEM_PROMPT        #language eng "DVMT Total Gfx Mem"
#string STR_DVMT_TOTAL_GFX_MEM_HELP          #language eng "Select DVMT 5.0 Total Graphic Memory size used by the Internal Graphics Device."
#string STR_DVMT_TOTAL_GFX_MEM_128MB         #language eng "128MB"
#string STR_DVMT_TOTAL_GFX_MEM_256MB         #language eng "256MB"
#string STR_DVMT_TOTAL_GFX_MEM_MAX           #language eng "Max"

// IGD Thermal
#string STR_IGD_THERMAL_PROMPT               #language eng "IGD Thermal"
#string STR_IGD_THERMAL_HELP                 #language eng "Enable/Disable IGD Thermal"

// Spread Spectrum clock
#string STR_SPREAD_SPECTRUM_CLOCK_PROMPT     #language eng "Spread Spectrum clock"
#string STR_SPREAD_SPECTRUM_CLOCK_HELP       #language eng "Enable/Disable Spread Spectrum clock"

//==============

// IGD - LCD Control
#string STR_IGD_LCD_CONTROL_FORM      #language eng "IGD - LCD Control"
#string STR_IGD_LCD_CONTROL_TITLE     #language eng "IGD - LCD Control"
#string STR_IGD_LCD_CONTROL_HELP      #language eng "IGD LCD Control Settings"

// Force Lid Status
#string STR_FORCE_LID_STATUS_PROMPT         #language eng "Force Lid Status"
#string STR_FORCE_LID_STATUS_HELP           #language eng "For test: force to set lid status as on or off."

// BIA
#string STR_BIA_PROMPT                      #language eng "BIA"
#string STR_BIA_HELP                        #language eng "Auto: GMCH Use VBIOS Default; Level n: Enabled with Selected Aggressivenness Level"
#string STR_BIA_LEVEL1                      #language eng "LEVEL1"
#string STR_BIA_LEVEL2                      #language eng "LEVEL2"
#string STR_BIA_LEVEL3                      #language eng "LEVEL3"
#string STR_BIA_LEVEL4                      #language eng "LEVEL4"
#string STR_BIA_LEVEL5                      #language eng "LEVEL5"

// ALS Support
#string STR_ALS_SUPPORT_PROMPT              #language eng "ALS Support"
#string STR_ALS_SUPPORT_HELP                #language eng "Valid only for ACPI"

// IGD Flat Panel
#string STR_IGD_FLAT_PANEL_PROMPT           #language eng "IGD Flat Panel"
#string STR_IGD_FLAT_PANEL_HELP             #language eng "IGD Flat Panel options"
#string STR_IGD_FLAT_PANEL_640_480          #language eng "640*480"
#string STR_IGD_FLAT_PANEL_800_600          #language eng "800*600"
#string STR_IGD_FLAT_PANEL_1024_768         #language eng "1024*768"
#string STR_IGD_FLAT_PANEL_1280_1024        #language eng "1280*1024"
#string STR_IGD_FLAT_PANEL_1366_768         #language eng "1366*768"
#string STR_IGD_FLAT_PANEL_1680_1050        #language eng "1680*1050"
#string STR_IGD_FLAT_PANEL_1600_1200        #language eng "1600*1200"
#string STR_IGD_FLAT_PANEL_1280_800         #language eng "1280*800"

// IGD Boot Type
#string STR_IGD_BOOT_TYPE_PROMPT            #language eng "IGD Boot Type"
#string STR_IGD_BOOT_TYPE_HELP              #language eng "Selects preference for Integrated Graphics Device (IGD) display interface used when system boots."
#string STR_IGD_BOOT_TYPE_VGA               #language eng "VGA"
#string STR_IGD_BOOT_TYPE_HDMI              #language eng "HDMI Port B"
#string STR_IGD_BOOT_TYPE_DPPORTB           #language eng "DP Port B"
#string STR_IGD_BOOT_TYPE_DPPORTC           #language eng "DP Port C"
#string STR_IGD_BOOT_TYPE_EDP               #language eng "eDP"
#string STR_IGD_BOOT_TYPE_DSIPORTA          #language eng "DSI Port A"
#string STR_IGD_BOOT_TYPE_DSIPORTC          #language eng "DSI Port C"

// Pannel Scaling
#string STR_PANNEL_SCALING_PROMPT          #language eng "Pannel Scaling"
#string STR_PANNEL_SCALING_HELP            #language eng "Pannel Scaling options"
#string STR_PANNEL_SCALING_CENTERING       #language eng "Centering"
#string STR_PANNEL_SCALING_STRETCHING      #language eng "stretching"

// GMCH BLC Control
#string STR_GMCH_BLC_PROMPT                 #language eng "GMCH BLC Control"
#string STR_GMCH_BLC_HELP                   #language eng "Back Light Control Setting"
#string STR_GMCH_BLC_BLC1                   #language eng "PWM-Inverted"
#string STR_GMCH_BLC_BLC2                   #language eng "GMBus-Inverted"
#string STR_GMCH_BLC_BLC3                   #language eng "PWM-Normal"
#string STR_GMCH_BLC_BLC4                   #language eng "GMBus-Normal"

//==============

// Memory Scrambler
#string STR_MEMORY_SCRAMBLER_PROMPT         #language eng "Memory Scrambler"
#string STR_MEMORY_SCRAMBLER_HELP           #language eng "Enable/Disable Memory Scrambler support."

//==============

// ISP PCI Device Configuration
#string STR_ISP_PCI_DEVICE_CONFIG_TITLE  #language eng "ISP PCI Device Configuration"
#string STR_ISP_PCI_DEVICE_CONFIG_HELP   #language eng "ISP PCI Device Configuration Options"

// ISP Enable/Disable
#string STR_ISP_EN_DIS_PROMPT               #language eng "ISP Enable/Disable"
#string STR_ISP_EN_DIS_HELP                 #language eng "Enable/Disable ISP PCI Device Selection"

// ISP PCI Device Selection
#string STR_ISP_PCI_DEVICE_SELECTION_PROMPT           #language eng "ISP PCI Device Selection"
#string STR_ISP_PCI_DEVICE_SELECTION_HELP             #language eng "Default ISP is PCI B0D2F0 for Window Boot. Linux Boot to Select B0D3F0."
#string STR_ISP_PCI_DEVICE_SELECTION_1                #language eng "ISP PCI Devce as B0D2F0"
#string STR_ISP_PCI_DEVICE_SELECTION_2                #language eng "ISP PCI Devce as B0D3F0"

//EIP154014 >>
// ISP PCI Device Selection
#string STR_ENABLE_PS2_VCCVNN_FORM             #language eng "Vcc, Vnn Configuration for Power state2:"
#string STR_ENABLE_PS2_VCCVNN_PROMPT           #language eng "Vcc_Vnn Config for Power state2"
#string STR_ENABLE_PS2_VCCVNN_HELP             #language eng "Enable or Disable Vcc Vnn Config for Power State2"
//EIP154014 <<

// Power Graphics
#string STR_GT_POWER_CONFIG_FORM_TITLE  #language eng "Graphics Power Management Control"
#string STR_GT_POWER_CONFIG_FORM_HELP   #language eng "Graphics Power Management Control Options"
#string STR_VIDEO_RS2_PROMPT            #language eng "RC6(Render Standby)"
#string STR_VIDEO_RS2_HELP              #language eng "Check to enable render standby support."

//----------------------------------------------------------------------------
// GOP Information
//----------------------------------------------------------------------------

#string STR_GOP_INFO                  #language eng "GOP Information"
#string STR_GOP_NAME                  #language eng "Intel(R) GOP Driver"
#string STR_GOP_VALUE                 #language eng "N/A" // Dynamically updated
#string STR_GOP_HELP                  #language eng "GOP driver version"

//----------------------------------------------------------------------------
// TXE Information
//----------------------------------------------------------------------------

#string STR_TXE_INFO                  #language eng "TXE Information"
#string STR_TXE_NAME                  #language eng "Sec RC Version "
#string STR_TXE_VALUE                 #language eng "N/A" // Dynamically updated
#string STR_TXE_HELP                  #language eng "Sec RC version."

#string STR_TXE_FW_NAME                  #language eng "TXE FW Version "
#string STR_TXE_FW_VALUE                 #language eng "N/A" // Dynamically updated
#string STR_TXE_FW_HELP                  #language eng "TXE FW version."

//---------------------------------------------------------------------------
// Thermal Configuration
//---------------------------------------------------------------------------
#string STR_THERMAL_CONFIGURATION_FORM                #language eng "Thermal Configuration"
#string STR_THERMAL_CONFIGURATION_HELP                #language eng "Thermal Configuration Parameters"

#string STR_S0IX_PROMPT                               #language eng "S0ix"
#string STR_S0IX_HELP                                 #language eng "Set Platform to configure S0ix supported or not"

#string STR_THERMAL_CONFIGURATION_TITLE               #language eng "Thermal Configuration Parameters"
#string STR_CRITICAL_TRIP_POINT_PROMPT                #language eng "Critical Trip Point"
#string STR_CRITICAL_TRIP_POINT_HELP                  #language eng "This value controls the temperature of the ACPI critical Trip Point in which the OS will shut the system off."
#string STR_PASSICE_TRIP_POINT_PROMPT                 #language eng "Passive Trip Point"
#string STR_PASSICE_TRIP_POINT_HELP                   #language eng "This value controls the temperature of the ACPI critical Trip Point - the point in which the OS will begin throtting the processor."

#string STR_DPTF                                      #language eng "Dynamic Platform&Thermal Framework"
#string STR_DPTF_SENSOR_0_TITLE                       #language eng "CPU Sensor Participant"
#string STR_DPTF_SENSOR_1_TITLE                       #language eng "Ambient Sensor Participant"
#string STR_DPTF_SENSOR_2_TITLE                       #language eng "DDR Sensor Participant"
//#string STR_DPTF_SENSOR_3_TITLE                       #language eng "DPTF Charger Board  Generic Sensor Participant"
//#string STR_DPTF_SENSOR_4_TITLE                       #language eng "DPTF Generic Sensor4 Participant"

#string STR_DPTF_ENABLE_PROMPT                        #language eng "DPTF"
#string STR_DPTF_ENABLE_HELP                          #language eng "Enable/Disable DPTF"
#string STR_DPTF_SENSOR_0_CRITICAL_PROMPT             #language eng "Critical"
#string STR_DPTF_SENSOR_0_CRITICAL_HELP               #language eng "Critical temperature"
#string STR_DPTF_SENSOR_1_CRITICAL_PROMPT             #language eng "Critical"
#string STR_DPTF_SENSOR_1_CRITICAL_HELP               #language eng "Critical temperature"
#string STR_DPTF_SENSOR_2_CRITICAL_PROMPT             #language eng "Critical"
#string STR_DPTF_SENSOR_2_CRITICAL_HELP               #language eng "Critical temperature"
//#string STR_DPTF_SENSOR_3_CRITICAL_PROMPT             #language eng "Critical"
//#string STR_DPTF_SENSOR_3_CRITICAL_HELP               #language eng "Critical temperature"
//#string STR_DPTF_SENSOR_4_CRITICAL_PROMPT             #language eng "Critical"
//#string STR_DPTF_SENSOR_4_CRITICAL_HELP               #language eng "Critical temperature"

#string STR_DPTF_SENSOR_0_PASSIVE_PROMPT              #language eng "Passive"
#string STR_DPTF_SENSOR_0_PASSIVE_HELP                #language eng "Passive temperature"
#string STR_DPTF_SENSOR_1_PASSIVE_PROMPT              #language eng "Passive"
#string STR_DPTF_SENSOR_1_PASSIVE_HELP                #language eng "Passive temperature"
#string STR_DPTF_SENSOR_2_PASSIVE_PROMPT              #language eng "Passive"
#string STR_DPTF_SENSOR_2_PASSIVE_HELP                #language eng "Passive temperature"
//#string STR_DPTF_SENSOR_3_PASSIVE_PROMPT              #language eng "Passive"
//#string STR_DPTF_SENSOR_3_PASSIVE_HELP                #language eng "Passive temperature"
//#string STR_DPTF_SENSOR_4_PASSIVE_PROMPT              #language eng "Passive"
//#string STR_DPTF_SENSOR_4_PASSIVE_HELP                #language eng "Passive temperature"

#string STR_DPTF_TEMPERATURE_15                       #language eng "15 C"
#string STR_DPTF_TEMPERATURE_23                       #language eng "23 C"
#string STR_DPTF_TEMPERATURE_25                       #language eng "25 C"
#string STR_DPTF_TEMPERATURE_30                       #language eng "30 C"
#string STR_DPTF_TEMPERATURE_31                       #language eng "31 C"
#string STR_DPTF_TEMPERATURE_35                       #language eng "35 C"
#string STR_DPTF_TEMPERATURE_39                       #language eng "39 C"
#string STR_DPTF_TEMPERATURE_40                       #language eng "40 C"
#string STR_DPTF_TEMPERATURE_45                       #language eng "45 C"
#string STR_DPTF_TEMPERATURE_47                       #language eng "47 C"
#string STR_DPTF_TEMPERATURE_50                       #language eng "50 C"
#string STR_DPTF_TEMPERATURE_52                       #language eng "52 C"
#string STR_DPTF_TEMPERATURE_55                       #language eng "55 C"
#string STR_DPTF_TEMPERATURE_60                       #language eng "60 C"
#string STR_DPTF_TEMPERATURE_61                       #language eng "61 C"
#string STR_DPTF_TEMPERATURE_63                       #language eng "63 C"
#string STR_DPTF_TEMPERATURE_64                       #language eng "64 C"
#string STR_DPTF_TEMPERATURE_65                       #language eng "65 C"
#string STR_DPTF_TEMPERATURE_70                       #language eng "70 C"
#string STR_DPTF_TEMPERATURE_71                       #language eng "71 C"
#string STR_DPTF_TEMPERATURE_75                       #language eng "75 C"
#string STR_DPTF_TEMPERATURE_79                       #language eng "79 C"
#string STR_DPTF_TEMPERATURE_80                       #language eng "80 C"
#string STR_DPTF_TEMPERATURE_85                       #language eng "85 C"
#string STR_DPTF_TEMPERATURE_87                       #language eng "87 C"
#string STR_DPTF_TEMPERATURE_90                       #language eng "90 C"
#string STR_DPTF_TEMPERATURE_95                       #language eng "95 C"
#string STR_DPTF_TEMPERATURE_100                      #language eng "100 C"
#string STR_DPTF_TEMPERATURE_105                      #language eng "105 C"
#string STR_DPTF_TEMPERATURE_110                      #language eng "110 C"
#string STR_DPTF_TEMPERATURE_115                      #language eng "115 C"
#string STR_DPTF_TEMPERATURE_120                      #language eng "120 C"
#string STR_DPTF_TEMPERATURE_125                      #language eng "125 C"

//P20130628 >>
//#string STR_DPTF_AMBIENTTRIPPOINTCHANGE_PROMPT         #language eng  "Ambient based Trip Point Change"
//#string STR_DPTF_AMBIENTTRIPPOINTCHANGE_HELP           #language eng  "This controls the Action part of the Ambient participant. When disabled, trip points would not be changed when Ambient participant notifies the FW of a new ambient temperature via _ATI."
//P20130628 <<

#string STR_SUPER_DEBUG_PROMPT              					#language eng "Super Debug"
#string STR_SUPER_DEBUG_HELP             							#language eng "Super debug is for validation purpose"
#string STR_CURRENT_LOGICAL_PROCESSOR_PROMPT          #language eng "Current Logical Processor"
#string STR_CURRENT_LOGICAL_PROCESSOR_HELP            #language eng "Controls LPO control preferences. Used only by Passice policy"

#string STR_OFFLINING_TITLE              						  #language eng "Offlining"

#string STR_START_P_STATE_PROMPT              				#language eng "Start P-State"
#string STR_START_P_STATE_HELP               					#language eng "Instructs the policy when to initiate Active Core control if enabled"
#string STR_START_P_STATE_P0													#language eng "P0"
#string STR_START_P_STATE_P1													#language eng "P1"
#string STR_START_P_STATE_P2													#language eng "P2"
#string STR_START_P_STATE_P3													#language eng "P3"
#string STR_START_P_STATE_P4													#language eng "P4"
#string STR_START_P_STATE_P5													#language eng "P5"
#string STR_START_P_STATE_P6													#language eng "P6"
#string STR_START_P_STATE_P7													#language eng "P7"
#string STR_START_P_STATE_P8													#language eng "P8"
#string STR_START_P_STATE_P9													#language eng "P9"
#string STR_START_P_STATE_P10													#language eng "P10"
#string STR_START_P_STATE_P11													#language eng "P11"
#string STR_START_P_STATE_P12													#language eng "P12"

#string STR_STEP_SIZE_PROMPT              						#language eng "Step size"
#string STR_STEP_SIZE_HELP               							#language eng "Instructs the policy to take away logical processors in the specified percentage steps."
#string STR_STEP_SIZE_25															#language eng "25%"
#string STR_STEP_SIZE_50															#language eng "50%"
#string STR_STEP_SIZE_75															#language eng "75%"

#string STR_POWER_CONTROL_SETTING_PROMPT              #language eng "Power Control Setting"
#string STR_POWER_CONTROL_SETTING_HELP               	#language eng "Instructs the policy whether to use Core offlining or SMT offlining if Active core contol is enabled to be used in P0 or when power control is applied"
#string STR_PERFORMANCE_CONTROL_SETTING_PROMPT        #language eng "Performance Control Setting"
#string STR_PERFORMANCE_CONTROL_SETTING_HELP          #language eng "Instructs the policy whether to use Core offlining or SMT offlining if Active core contol is enabled to be used in P1 or when power control is applied"
#string STR_OFFINING_SMT															#language eng "SMT offlining"
#string STR_OFFINING_CORE															#language eng "CORE offlining"

#string STR_DPPM_PROMPT              									#language eng "DPPM"
#string STR_DPPM_HELP              										#language eng "Controls DPPM policies"
#string STR_CLPM_PROMPT               								#language eng "CLPM"
#string STR_CLPM_HELP               									#language eng "Current Low Power Mode"
#string STR_CLPM_APPLECATION_SPECIFIC									#language eng "Application specific"									
#string STR_CLPM_OS_LEVEL															#language eng "OS level"									

#string STR_DPTF_PROCESSOR_PROMPT              				#language eng "DPTF processor"
#string STR_DPTF_PROCESSOR_HELP               				#language eng "Enable/Disable Processor Participant Device"

#string STR_SYSTEM_THERMAL_SENESOR1_PROMPT            #language eng "CPU Sensors"
#string STR_SYSTEM_THERMAL_SENESOR1_HELP              #language eng "Enable/Disable CPU Temperature Sensors"
#string STR_SYSTEM_THERMAL_SENESOR2_PROMPT            #language eng "Ambient Sensors"
#string STR_SYSTEM_THERMAL_SENESOR2_HELP              #language eng "Enable/Disable Ambient Temperature Sensors"
#string STR_SYSTEM_THERMAL_SENESOR3_PROMPT            #language eng "DDR Sensors"
#string STR_SYSTEM_THERMAL_SENESOR3_HELP              #language eng "Enable/Disable DDR Temperature Sensors"
//#string STR_SYSTEM_THERMAL_SENESOR4_PROMPT            #language eng "Charger Board Sensor"
//#string STR_SYSTEM_THERMAL_SENESOR4_HELP              #language eng "Enable/Disable Charger Board Skin Temperature Sensor"
//#string STR_SYSTEM_THERMAL_SENESOR5_PROMPT            #language eng "Ambient Temperature"
//#string STR_SYSTEM_THERMAL_SENESOR5_HELP              #language eng "Enable/Disable Ambient Temperature"

#string STR_CHARGER_PARTICIPANT_PROMPT            		#language eng "Charger Participant"
#string STR_CHARGER_PARTICIPANT_HELP              		#language eng "Enable/Disable Charger Participant Device"
#string STR_DISPLAY_PARTICIPANT_PROMPT            		#language eng "Display Participant"
#string STR_DISPLAY_PARTICIPANT_HELP              		#language eng "Enable/Disable Display Participant Devic"
#string STR_SOC_PARTICIPANT_PROMPT            				#language eng "Power Participant"
#string STR_SOC_PARTICIPANT_HELP              				#language eng "Enable/Disable SOC Participant Devic"

//----------------------------------------------------------------------------
// 
//----------------------------------------------------------------------------
//EIP126704  Select dynamic or fixed mmio size.>>
#string STR_MAX_TOLUD_PROMPT                    #language eng "Max TOLUD"
#string STR_MAX_TOLUD_HELP                      #language eng "Maximum Value of TOLUD."
#string STR_MAX_TOLUD_DYNAMIC_STRING            #language eng "Dynamic"
#string STR_MAX_TOLUD_3_5G_STRING               #language eng "3.5 GB"
#string STR_MAX_TOLUD_3_25G_STRING              #language eng "3.25 GB"
#string STR_MAX_TOLUD_3G_STRING                 #language eng "3 GB"
#string STR_MAX_TOLUD_2_75G_STRING              #language eng "2.75 GB"
#string STR_MAX_TOLUD_2_5G_STRING               #language eng "2.5 GB"
#string STR_MAX_TOLUD_2_25G_STRING              #language eng "2.25 GB"
#string STR_MAX_TOLUD_2G_STRING                 #language eng "2 GB"
#string STR_MAX_TOLUD_1_75G_STRING              #language eng "1.75 GB"
#string STR_MAX_TOLUD_1_5G_STRING               #language eng "1.5 GB"
#string STR_MAX_TOLUD_1_25G_STRING              #language eng "1.25 GB"
#string STR_MAX_TOLUD_1G_STRING                 #language eng "1 GB"
//EIP126704  Select dynamic or fixed mmio size. <<
//----------------------------------------------------------------------------
// Common String
//----------------------------------------------------------------------------
#string STR_COMMON_AUTO                 #language eng "AUTO"
#string STR_COMMON_ENABLED              #language eng "Enabled"
#string STR_COMMON_DISABLED             #language eng "Disabled"
#string STR_COMMON_ON                   #language eng "ON"
#string STR_COMMON_OFF                  #language eng "OFF"

//EIP150350 >> 
//----------------------------------------------------------------------------
//VBIOS configuration
//----------------------------------------------------------------------------
#string STR_IGFX_LCD                            #language eng "LCD Control"

#string STR_VIDEO_BT_DEFAULT                    #language eng "VBIOS Default"

#string STR_PANELTYPE_PROMPT                    #language eng "LCD Panel Type"
#string STR_PANELTYPE_HELP                      #language eng "Select LCD panel used by Internal Graphics Device by selecting the appropriate setup item."
#string STR_PANELTYPE_01                        #language eng "640x480       LVDS"
#string STR_PANELTYPE_02                        #language eng "800x600       LVDS"
#string STR_PANELTYPE_03                        #language eng "1024x768      LVDS1"
#string STR_PANELTYPE_04                        #language eng "1280x1024     LVDS"
#string STR_PANELTYPE_05                        #language eng "1400x1050(RB) LVDS1"
#string STR_PANELTYPE_06                        #language eng "1400x1050     LVDS2"
#string STR_PANELTYPE_07                        #language eng "1600x1200     LVDS"
#string STR_PANELTYPE_08                        #language eng "1366x768      LVDS"
#string STR_PANELTYPE_09                        #language eng "1680x1050     LVDS"
#string STR_PANELTYPE_10                        #language eng "1920x1200     LVDS"
#string STR_PANELTYPE_11                        #language eng "1440x900      LVDS"
#string STR_PANELTYPE_12                        #language eng "1600x900      LVDS"
#string STR_PANELTYPE_13                        #language eng "1024x768      LVDS2"
#string STR_PANELTYPE_14                        #language eng "1280x800      LVDS"
#string STR_PANELTYPE_15                        #language eng "1920x1080     LVDS"
#string STR_PANELTYPE_16                        #language eng "2048x1536     LVDS"

#string STR_PANELSCALING_PROMPT                 #language eng "Panel Scaling"
#string STR_PANELSCALING_HELP                   #language eng "Select the LCD panel scaling option used by the Internal Graphics Device."
#string STR_PANELSCALING_AUTO                   #language eng "Auto"
#string STR_PANELSCALING_FORCE                  #language eng "Force Scaling"
#string STR_PANELSCALING_OFF                    #language eng "Off"
#string STR_PANELSCALING_ASPECT_RATIO           #language eng "Maintain Aspect Ratio"

#string STR_VIDEO_BT_PROMPT                     #language eng "Primary IGFX Boot Display"
#string STR_VIDEO_BT_HELP                       #language eng "Select the Video Device which will be activated during POST.\nThis has no effect if external graphics present.\nSecondary boot display selection will appear based on your selection.\nVGA modes will be supported only on primary display\n"
#string STR_VIDEO_BT_DEFAULT                    #language eng "VBIOS Default"
#string STR_VIDEO_BT_CRT                        #language eng "CRT"
#string STR_VIDEO_BT_LFP                        #language eng "LFP"
#string STR_VIDEO_BT_LFP2                       #language eng "LFP2"
#string STR_VIDEO_BT_EFP                        #language eng "EFP"
#string STR_VIDEO_BT_EFP2                       #language eng "EFP2"
#string STR_VIDEO_BT_EFP3                       #language eng "EFP3"
                                                
#string STR_VIDEO_LCD_BLC                       #language eng "Backlight Control"
#string STR_VIDEO_LCD_BLCHELP                   #language eng "Back Light Control Setting" 
#string STR_VIDEO_LCD_BLC1                      #language eng "PWM Inverted"
#string STR_VIDEO_LCD_BLC2                      #language eng "PWM Normal"
#string STR_VIDEO_LCD_BLC3                      #language eng "GMBus Inverted"
#string STR_VIDEO_LCD_BLC4                      #language eng "GMBus Normal"                                                                                           
                                                
#string STR_ACTIVE_LFP                          #language eng "Active LFP"        
#string STR_ACTIVE_LFP_HELP                     #language eng "Select the Active LFP Configuration.\n\nNo LVDS:VBIOS does not enable LVDS.\nInt-LVDS:VBIOS enables LVDS driver by Integrated encoder.\nSDVO LVDS:VBIOS enables LVDS driver by SDVO encoder.\neDP Port-A:LFP Driven by Int-DisplayPort encoder from Port-A.\neDP Port-D:LFP Driven by Int-DisplayPort encoder from Port-D(through PCH)."        
#string STR_NO_LVDS_STRING                      #language eng "No LVDS"        
#string STR_INT_LVDS_STRING                     #language eng "Int-LVDS"        
#string STR_SDVO_LVDS_STRING                    #language eng "SDVO LVDS"        
#string STR_EDPA_LFP_STRING                     #language eng "eDP Port-A"        
#string STR_EDPD_LFP_STRING                     #language eng "eDP Port-D"                                                                                                    
                    
#string STR_PRIMARY_VIDEO                       #language eng "Primary Display"
#string STR_PRIMARY_VIDEO_HELP                  #language eng "Select which of IGFX/PEG/PCI Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_IGFX_STRING                         #language eng "IGFX"
#string STR_PEG_STRING                          #language eng "PEG"
#string STR_PCIE_STRING                         #language eng "PCIE"
#string STR_SG_STRING                           #language eng "SG"                                              
                    
#string STR_VIDEO_BT_PIPE_B_PROMPT              #language eng "Secondary IGFX Boot Display"
#string STR_VIDEO_BT_PIPE_B_HELP                #language eng "Select Secondary Display Device"
#string STR_VIDEO_BT_PIPE_B_DISABLED            #language eng "Disabled"                                       
                                                
#string STR_SDVO_PANELTYPE_PROMPT               #language eng "SDVO-LFP Panel Type"
#string STR_SDVO_PANELTYPE_HELP                 #language eng "Select SDVO panel used by Internal Graphics Device by selecting the appropriate setup item."
#string STR_SDVO_PANELTYPE_01                   #language eng "1024x768     SDVO-LFP"
#string STR_SDVO_PANELTYPE_02                   #language eng "1280x1024    SDVO-LFP"
#string STR_SDVO_PANELTYPE_03                   #language eng "1400x1050    SDVO-LFP"
#string STR_SDVO_PANELTYPE_04                   #language eng "1600x1200    SDVO-LFP"
//EIP150350 <<
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

